{
  "main": {
    "name": "Renu Suresh Ganvir",
    "description": "I am a web development engineer and I use react and Angular to develop pages. This project is a resume template, in which tech stack I used is React",
    "bio": "I am a highly competent IT professional with a proven track record in designing websites.I have strong technical skills as well as excellent interpersonal skills, enabling me to interact with a wide range of clients.(US and UK). I am currently looking for an opportunity to utilise my technical skills in a challenging working environment and become a valuable asset to the organisation that I work for.",
    "email": "rganvir500@gmail.com",
    "github": "https://github.com/RenuSuresh/portfolio",
    "project": "https://github.com/RenuSuresh/portfolio",
    "image": "profile.jpg",
    "address": {
      "street": "Palam",
      "state": "New Delhi",
      "zip": 110077
    },
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/renu-suresh-ganvir-a2562b125",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/RenuSuresh",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "Karunya Institute of technology and sciences",
        "degree": "Bachelor of Technology (Computer Science)",
        "graduated": "June 2018",
        "description": "Key skills I have learned, Operating System, Algorithm, Data Structure, Web Development. College taught me that the discipline of earning a degree is an indicator for potential employers and/or clients that a graduate has the diligence to analyze problems, learn and find the right answers. "
      }
    ],
    "work": [
      {
        "company": "Wipro Ltd.",
        "title": "Project Engineer",
        "years": "July 2018 - Present",
        "description": [
          {
            "client": "Client 1: US Bank",
            "description": [
              "Worked with team of 15, reduced usage of redirects and utilized dataStorage as cache, which ultimately reduced the load time of application by 5%;",
              "Developed B2B transaction for Tellers in the bank, that includes managing digital check and denomination in the same session, using Angular and API",
              "Streamlined the data flow inside angular components by ensuring the api calls were standardized.",
              "Developed UI design for the app, that includes validation and displayed the share data in different components of the module."
            ],
            "techStack": ["Angular 6", "HTML", "CSS", "Bootstrap", "TypeScript"]
          },
          {
            "client": "Client 2: Wipro-Holmes",
            "description": [
              "Developed a document analysing and managing app which helps in reviewing it.",
              "Used the accuracy which ML team will send, and used as API to manage and manipulate file data.",
              "Working on UI to be deployed on serverless to reduce the cost of app running on server by 12%"
            ],
            "techStack": [
              "Angular 6",
              "HTML",
              "less",
              "Bootstrap",
              "TypeScript",
              "AWS S3",
              "API Gateway"
            ]
          },
          {
            "client": "Client 3: Fleet-UK",
            "description": [
              "Working as a single-person UI and UX development of React app, to manage the petrol cards details by the drivers",
              "Standardized UX screen with the guidelines, used figma, to achieve the design",
              "Using React-redux, to manage states and update it, that will help, to maintain and manage the code more redable than cobol by 70%"
            ],
            "techStack": [
              "React",
              "CSS",
              "React-Redux",
              "Redux",
              "Bootstrap",
              "Redux-thunk"
            ]
          }
        ]
      }
    ],
    "skills": [
      {
        "name": "Javascript",
        "level": "80%"
      },

      {
        "name": "ReactJs",
        "level": "70%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },

      {
        "name": "Angular",
        "level": "80%"
      },
      {
        "name": "Python",
        "level": "60%"
      }
    ]
  }
}
